In [23]:
import pandas as pd
import numpy as np

tb1 = {'Rank':[1,2,3,4,5],
      'Cluster':[3,8,7,1,10]}
table1 = pd.DataFrame(data=tb1)

tb2 = {'Num': np.random.randn(5),
      'Cluster':[10,3,8,5,7]}
table2 = pd.DataFrame(data=tb2)

In [24]:
table1

   Cluster  Rank
0        3     1
1        8     2
2        7     3
3        1     4
4       10     5

In [25]:
table2

   Cluster       Num
0       10 -0.851851
1        3  1.418564
2        8  1.156336
3        5 -1.122365
4        7 -0.186420

Use the following code to update table2:

In [26]:
def find_rank(x):
    try:
        return table1[table1['Cluster']==x]['Rank'].values[0]
    except:
        return "NA"

In [27]:
table2['Rank'] = table2['Cluster'].map(lambda x: find_rank(x))

In [28]:
table2

   Cluster       Num Rank
0       10 -0.851851    5
1        3  1.418564    1
2        8  1.156336    2
3        5 -1.122365   NA
4        7 -0.186420    3